CSI API ETABS v1

# cLoadCasesCount Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int Count(
    	eLoadCaseType CaseType =
    )

    Function Count (
    	Optional CaseType As eLoadCaseType =
    ) As Integer

    Dim instance As cLoadCases
    Dim CaseType As eLoadCaseType
    Dim returnValue As Integer

    returnValue = instance.Count(CaseType)

    int Count(
    	eLoadCaseType CaseType =
    )

    abstract Count :
            ?CaseType : eLoadCaseType
    (* Defaults:
            let _CaseType = defaultArg CaseType
    *)
    -> int

#### Parameters

CaseType (Optional)

    Type: ETABSv1eLoadCaseType

#### Return Value

Type: Int32

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com